# ModuleSettings Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModuleSettings Constructor
ModuleSettings Class See Also
---
Constructs a new module settings.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ModuleSettings(
	string name,
	MacroLanguageType macroLanguageType
)
```

Visual Basic
---
```text
Public Sub New ( _
	name As String, _
	macroLanguageType As MacroLanguageType _
)
```

Visual C++
---
```text
public:
ModuleSettings(
	String^ name,
	MacroLanguageType macroLanguageType
)
```

# ### Parameters
name
    Type: System..::..String The module name.
macroLanguageType
    Type: Autodesk.Revit.DB.Macros..::..MacroLanguageType The Macro language type.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ModuleSettings Class
Autodesk.Revit.DB.Macros Namespace